{"data":{"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/internal-links-c/"},"excerpt":"Contents Why would I need this? How does this app work? How do I run the demo? Why would I need this? In  part 1  and  part 2 ,\nwe learned how to create custom links to other pages in our shiny app\nand how to embed links in visualizations. But what…","frontmatter":{"excerpt":"This is part 3 in the linking tabs series. What we wanted to go to a specific tab on another page in our shiny app? We need to make one little adjustment to our setup to do this.","date":"August 2018","title":"Linking Tabs - Part 3","keywords":["javascript"]}}},{"node":{"fields":{"slug":"/internal-links-b/"},"excerpt":"Contents Why would I need this? How does this app work? How do I run the demo? Why would I need this? In the part 1, we learned about setting up\n tabPanels  and building hyperlinks manually using a  javascript \nfunction. This is great, but is there…","frontmatter":{"excerpt":"This tutorial picks up after part 1. What can we do with our custom links? How about adding them in a leaflet popup?","date":"August 2018","title":"Linking Tabs - Part 2","keywords":["javascript","leaflet"]}}},{"node":{"fields":{"slug":"/data-editor/"},"excerpt":"Contents Why would I need this? How does the app work? How can I run the demo? Why would I need this? This app was created in order to figure out a question I ' ve had for a\nwhile:  \" How can I edit a dataset in a shiny app? \" I ' ve developed…","frontmatter":{"excerpt":"Have you ever wanted to edit data in a shiny app? Learn how to build a shiny app for editing data and saving changes to file, and then reloading the changes into your app.","date":"March 2018","title":"Data Editor","keywords":["rhandsontable"]}}},{"node":{"fields":{"slug":"/login-screen/"},"excerpt":"Contents Why would I need a login screen? How does the login screen work? What else should I know before using this? How do I run the demo? Why would I need this? You probably do not need and you should use other well-defined methods\nthan this one…","frontmatter":{"excerpt":"In my app, I don't want every user to see every pages. Can I control this? Yes! Here's how to do it.","date":"March 2018","title":"Login Screen","keywords":["access-control"]}}},{"node":{"fields":{"slug":"/internal-links-a/"},"excerpt":"Contents Why would I need this? How does it work? Are there any issues? How do I run the demo? Why would I need this? Traditionally, web links are created by using the  < a >  element and\nassigning a location through href. In shiny, you would do…","frontmatter":{"excerpt":"Creating links to other pages in your shiny app can be challenging as ids are overwritten each time a shiny app launches. Instead, we will learn how to create new links using javascript.","date":"March 2018","title":"Linking Tabs - Part 1","keywords":["javascript"]}}},{"node":{"fields":{"slug":"/landing-page/"},"excerpt":"Contents Why would I need this? How does this work? How do I run the demo? Why would I need this? In this community.rstudio.com  question ,\nthere was a question on placing content on top of four images arranged\nin a 2 x 2 layout. The purpose of this…","frontmatter":{"excerpt":"Are you tired of the same start up pages? Learn how to overlay content on a series of images. This demo was inspired by a community.rstudio post.","date":"March 2018","title":"Landing Page","keywords":["css"]}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}