{"errors":[{"message":"Expected Iterable, but did not find one for field MarkdownRemarkFrontmatter.keywords.","locations":[{"line":11,"column":7}],"path":["markdownRemark","frontmatter","keywords"]}],"data":{"markdownRemark":{"html":"<h2>Contents</h2>\n<ol>\n<li><a href=\"#about\">About</a></li>\n<li>\n<p><a href=\"#questions\">Questions</a></p>\n<ol>\n<li><a href=\"#standard\">Standard</a></li>\n<li><a href=\"#knowledge\">Knowledge</a></li>\n<li><a href=\"#experience\">Experience</a></li>\n<li><a href=\"#task-based\">Task-based</a></li>\n</ol>\n</li>\n<li><a href=\"#Tips\">Tips</a></li>\n</ol>\n<span id=\"about\"/>\n<h2>About</h2>\n<p>For R and shiny enthusiasts, landing a role with the main focus on using shiny is a dream come true. </p>\n<p>Before learning how to write code, most of my experience was in clinical research and case work. Overtime, I became interested in the data side of running research studies and trials. I was fortunate in my early career to get the opportunity to learn more about databases, developing computerized tasks for experimentation, and analyzing data. </p>\n<p>In my first research position, I was tasked to learn R and analyze data for a paper. I had no experience working in a scripting environment nor had I used a command line. I had a lot of good support and help from my mentor to learn more. During this time, I caught the coding bug and wanted to learn everything I could. Over the next few years, I held a positions where experience in R was preferred, but it wasn't the primary focus. These opportunities allowed me to continue to learn and build up a portfolio. </p>\n<p>Fast forward six years, I landed my first full-time development job that had a focus in R and shiny. Everyday, I conducted analysis which led to shinyapps and visualizations for various internal reporting platforms. This post includes some tips for moving your career into a development area and some interview questions that you may want to think about. The questions are grouped into a few sections: knowledge, experience, and tasked-based questions.</p>\n<p>All questions were written down as soon close to the end of the interview as possible. Many of the interviews that I attended, required that I complete a task ahead of the interview (i.e., a week before or the day of). I've grouped these questions into the \"tasked-based\" section. As these questions were specific to the interview task, the concepts or themes highlighted in the questions might give you an indication of what to expect.</p>\n<span id=\"questions\"/>\n<h2>Questions</h2>\n<h3>Standard</h3>\n<ul>\n<li>\"Why did you apply for this job?\"</li>\n<li>\"What do you want to get out of this role?\"</li>\n</ul>\n<h3>Knowledge</h3>\n<ul>\n<li><strong>Design</strong>: \"When preparing visualizations, what features - specifically design elements - do you use? In other words, what are the key elements for an effective presentation?\"</li>\n</ul>\n<h3>Experience</h3>\n<ul>\n<li><strong>Impact</strong>: \"What are some experiences you had where your report was used to make an impact?\"</li>\n<li><strong>Managing Differences</strong>: \"How would you handle a situation where others many have a difference of opinion to even if the outcomes are the same? This could be in design, methodology, etc.\"</li>\n<li><strong>Time Management</strong>: \"In this role, you will encounter periods of high-demand, overlapping deadlines, </li>\n</ul>\n<h3>Task-based</h3>\n<ul>\n<li>\n<p><strong>Scenario</strong>: suppose there is a major issue that occurred during data collection or entry that effected the reporting process. Prepare a presentation on a situation where this occured in your line of work. </p>\n<ul>\n<li>\"Describe what systems you would put in place to prevent issues like this from occuring. So, what checks would you run? How would you validate data before reporting on it?\"</li>\n</ul>\n</li>\n<li>\n<p><strong>Analysis Skills</strong>: For one interview, I was given a dataset a week before the interview and asked to find the answers to a series of questions. These questions were fairly straightforward - \"Which group had the most X?\" and \"What was the average Y by Z?\" and so forth. I was also asked to conduct my own analysis and to create a visualization based on my findings. The questions asked on this part of the interview are as followed.</p>\n<ul>\n<li>\"Talk about your approach to completing the visualization. So, from a design perspective. Why did you choose this design?\"</li>\n<li>\"How did you approach cleaning the data?\" </li>\n<li>\"Tell us about the results and what it tells about the research topic\"</li>\n</ul>\n</li>\n</ul>\n<h2>Tips</h2>\n<ul>\n<li>Interview panels want specifics and real life examples. In your job materials and during the interview, makes sure you are providing evidence from your professional experience.</li>\n</ul>","frontmatter":{"title":"Data Viz Interview Questions","subtitle":"A list of interview questions that I've been asked","excerpt":"Making the switch from academic research to a development post took a long period of time and was challenging. The tricky part was doing well in the first interview. I've collated a list of questions that I was asked during job interviews.","date":"2019-04-03","keywords":null}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/interview-questions/"}}