{"data":{"allMarkdownRemark":{"edges":[{"node":{"fields":{"slug":"/interview-questions/draft-index/"},"excerpt":"Contents About Questions Standard Knowledge Experience Task-based Tips About For R and shiny enthusiasts, landing a role with the main focus on using shiny is a dream come true.  Before learning how to write code, most of my experience was in…","frontmatter":{"abstract":"Making the switch from academic research to a development post took a long period of time and was challenging. The tricky part was doing well in the first interview. I've collated a list of questions that I was asked during job interviews.","date":"April 2019","title":"Data Viz Interview Questions","keywords":["career"]}}},{"node":{"fields":{"slug":"/network-d3/draft-index/"},"excerpt":"Contents Why would I need this? How does this app work? How can I run the demo? Why would I need this? Network analysis and visualizations provide a ... for showing interconnectivity in a given sample. In R, there are number of R packages for…","frontmatter":{"abstract":"The networkD3 package allows you to build interactive networks. In this tutorial, learn how to create custom onclick events and add custom styles.","date":"April 2019","title":"Shiny and networkD3","keywords":["networkD3"]}}},{"node":{"fields":{"slug":"/internal-links-c/"},"excerpt":"Contents Why would I need this? How does this app work? How do I run the demo? Why would I need this? In  part 1  and  part 2 ,\nwe learned how to create custom links to other pages in our shiny app\nand how to embed links in visualizations. But what…","frontmatter":{"abstract":"Okay. I have created custom navigation. What if my app has multiple pages with tabs. How do I go to a specific tab on another page?","date":"August 2018","title":"Linking Tabs - Part 3","keywords":["javascript"]}}},{"node":{"fields":{"slug":"/internal-links-b/"},"excerpt":"Contents Why would I need this? How does this app work? How do I run the demo? What's next? Why would I need this? In the  part 1 , we learned about setting up\n tabPanels  and building hyperlinks manually using a  javascript \nfunction. This is great…","frontmatter":{"abstract":"Now that I created custom links, what can I do with them? How about adding them in a leaflet popup?","date":"August 2018","title":"Linking Tabs - Part 2","keywords":["javascript","leaflet"]}}},{"node":{"fields":{"slug":"/internal-links-a/"},"excerpt":"Contents Why would I need this? How does it work? Are there any issues? How do I run the demo? What's next? Why would I need this? Traditionally, web links are created by using the  < a >  element and\nassigning a location through href. In shiny, you…","frontmatter":{"abstract":"Creating links to other pages in your shiny app can be challenging as ids are overwritten each time a shiny app launches. Instead, we will learn how to create new links using javascript.","date":"March 2018","title":"Linking Tabs - Part 1","keywords":["javascript"]}}},{"node":{"fields":{"slug":"/landing-page/"},"excerpt":"Contents Why would I need this? How does this work? How do I run the demo? Why would I need this? Over on community.rstudio.com, there was  a question \non placing content on top of four images arranged in a  2x2  layout. The purpose of this tutorial…","frontmatter":{"abstract":"Are you tired of the same start up pages? Learn how to create a cool landing page. This demo was inspired by a post on community.rstudio.com.","date":"March 2018","title":"Landing Page","keywords":["css"]}}},{"node":{"fields":{"slug":"/login-screen/"},"excerpt":"Contents Why would I need a login screen? How does the login screen work? What else should I know before using this? How do I run the demo? Why would I need this? You probably do not need and you should use other well-defined methods\nthan this one…","frontmatter":{"abstract":"In my app, I want to set up some sort of user authentication where certain groups can see some pages and some groups can see all pages. Can I do this in shiny? Yes! Here's how to do it.","date":"March 2018","title":"Login Screen","keywords":["access-control"]}}},{"node":{"fields":{"slug":"/data-editor/"},"excerpt":"Contents Why would I need this? How does the app work? How can I run the demo? Why would I need this? This app was created in order to figure out a question I ' ve had for a\nwhile:  \" How can I edit a dataset in a shiny app? \" I ' ve developed…","frontmatter":{"abstract":"Have you ever wanted to edit data in a shiny app? Learn how to build a shiny app for editing data and saving changes to file, and then reloading the changes into your app.","date":"March 2018","title":"Data Editor","keywords":["rhandsontable"]}}}]}},"pageContext":{"isCreatedByStatefulCreatePages":true}}